updated Readme Architekturdiagramm
